package org.eodnorog.kotlincourse.lesson7

fun main() {

}

//Задания для Прерывания и Пропуска Итерации
//Использование break:
//- Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.


//- Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.


//Использование continue:
//- В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.


//- Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.


//Задача на вложенный цикл
//- Создать цикл в цикле, в каждом использовать диапазон от 1 до 10.
//В консоль вывести результат умножения переменных цикла.
//Результат умножения выводить через print() и добавлять ещё один print(“ ”) с пробелом, чтобы отделять значения в строку.
//После вложенного цикла выводить пустой println() чтобы следующий проход начинать с новой строки.
//Результат должен быть как на картинке.


