package org.eodnorog.kotlincourse.lesson7

fun main() {

}

//Дополнительные задания
//
//1) Вывод чисел от 1 до 10: Напишите программу, которая выводит числа от 1 до 10 с использованием цикла while.

//2) Четные числа до 20: Используя цикл while, выведите все четные числа от 2 до 20.

//3) Сумма чисел от 1 до 50: Напишите программу, которая суммирует числа от 1 до 50 с помощью цикла while.

//4) Вывод чисел от 10 до 1: Используя цикл do while, выведите числа от 10 до 1.

//5) Факториал числа 5: Напишите программу, которая вычисляет факториал числа 5 с использованием цикла while.

//6) Сумма четных чисел до 100: Используя цикл while, найдите сумму всех четных чисел от 2 до 100.

//7) Таблица умножения на 3: Напишите программу, которая выводит таблицу умножения на 3.

//8) Вывод символов до точки: Используя цикл do while, выведите символы строки "Kotlin." по одному до точки.

//9) Наибольшее число из списка: Напишите программу, которая находит наибольшее число из заданного списка чисел с использованием цикла while. Пример списка: [5, 12, 7, 22, 9]

//10) Генерация чисел до 15: Используя цикл do while, напишите программу, которая генерирует и выводит числа от 1 до 15.

//11) Простые числа до 20: Напишите программу, которая выводит все простые числа до 20 с использованием цикла while.

//12) Обратный порядок элементов массива: Создайте массив из 10 элементов и выведите его элементы в обратном порядке с помощью цикла while.

//13) Количество итераций до 100: Напишите программу, которая увеличивает счетчик на 1 в цикле while до тех пор, пока значение счетчика не достигнет 100. Выведите количество итераций.

//14) Прямоугольник из символов: Используя вложенные циклы while, выведите прямоугольник размером 5x3 из символов *.

//15) Числа Фибоначчи до 50: Напишите программу, которая выводит все числа Фибоначчи, не превышающие 50, с использованием цикла while.

//16) Счетчик шагов: Создайте программу, которая считает шаги от 0 до 30 с шагом 5, используя цикл while.

//17) Среднее значение фиксированного списка чисел: Найдите среднее значение чисел из списка [4, 8, 15, 16, 23, 42] с помощью цикла while.

//18) Таблица умножения с вложенными циклами: Используя вложенные циклы do while, напишите программу для вывода таблицы умножения от 1 до 5.

//19) Сумма чисел в диапазоне: Напишите программу, которая находит сумму чисел от 10 до 30 с использованием цикла while.

//20) Сумма четных и нечетных чисел: Используя цикл while, найдите отдельно сумму четных и сумму нечетных чисел от 1 до 20.

