package org.eodnorog.kotlincourse.lesson4

//Типы данных

// Целочисленные типы
//Byte: хранит целое число от -128 до 127 и занимает 1 байт
//
//Short: хранит целое число от -32 768 до 32 767 и занимает 2 байта
//
//Int: хранит целое число от -2 147 483 648 (-231) до 2 147 483 647 (231 - 1) и занимает 4 байта
//
//Long: хранит целое число от –9 223 372 036 854 775 808 (-263) до 9 223 372 036 854 775 807 (263-1) и занимает 8 байт
//
//В последней версии Kotlin также добавлена поддержка для целочисленных типов без знака:
//
//UByte: хранит целое число от 0 до 255 и занимает 1 байт
//
//UShort: хранит целое число от 0 до 65 535 и занимает 2 байта
//
//UInt: хранит целое число от 0 до 232 - 1 и занимает 4 байта
//
//ULong: хранит целое число от 0 до 264-1 и занимает 8 байт


//Числа с плавающей точкой
//Кроме целочисленных типов в Kotlin есть два типа для чисел с плавающей точкой, которые позволяют хранить дробные числа:
//
//Float: хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта
//
//Double: хранит число с плавающей точкой от ±5.0*10-324 до ±1.7*10308 и занимает 8 байта.


//Логический тип Boolean
//Тип Boolean может хранить одно из двух значений: true (истина) или false (ложь).


//Символы
//Символьные данные представлены типом Char. Он представляет отдельный символ, который заключается в одинарные кавычки.


//Строки
//Строки представлены типом String.
//Строка представляет последовательность символов, заключенную в двойные кавычки, либо в тройные двойные кавычки.

//Тип Any
//В Kotlin также есть тип Any, который позволяет присвоить переменной данного типа любое значение:
